#+TITLE: EBS Pollock - spatq
#+PROPERTY: header-args:R :session *R-ebspollock* :tangle yes

#+BEGIN_SRC R
library(tidyverse)
library(INLA)
library(sf)
devtools::load_all("~/src/FishStatsUtils", helpers = FALSE, export_all = FALSE)
devtools::load_all("~/src/VAST", helpers = FALSE, export_all = FALSE)
devtools::load_all("~/src/spatq", helpers = FALSE)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R
pollock <- load_example(data_set = "EBS_pollock")$sampling_data %>%
    mutate(time = Year - min(Year) + 1,
           vessel_idx = 1) %>%
    select(time, vessel_idx, effort = AreaSwept_km2,
           catch_biomass = Catch_KG, lat = Lat, lon = Lon) %>%
    st_as_sf(crs = 4326, coords = c("lon", "lat")) %>%
    st_transform(32602)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R
t_max <- 5
## Center the northing and easting separately, then scale manually
locs <- apply(st_coordinates(pollock), 2, scale, scale = FALSE) / 1e3
colnames(locs) <- c("s1", "s2")
pollock_df <- pollock %>%
  st_drop_geometry() %>%
  mutate(s1 = locs[, "s1"],
         s2 = locs[, "s2"]) %>%
  filter(time <= t_max)

hull <- inla.nonconvex.hull(locs, convex = -0.01, resolution = 200)
## plot(hull$loc, type = 'l', col = "blue")
## points(locs)
mesh <- inla.mesh.2d(loc = locs[sample(seq_len(nrow(locs)), 1000), ],
                     offset = c(0, 200),
                     max.n = 1000,
                     boundary = hull,
                     max.edge = c(100, 200),
                     cutoff = 10)

## plot(mesh)
## points(locs, col = "red")
fem <- generate_fem(mesh)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R
s1_range <- range(locs[, 1])
s2_range <- range(locs[, 2])

index_step <- 100
index_df <- cross_df(list(
  s1 = seq(s1_range[1] / 2, s1_range[2] / 2, length.out = 10),
  s2 = seq(s2_range[1] / 2, s2_range[2] / 2, length.out = 10),
  time = unique(pollock_df$time)))
#+END_SRC

#+RESULTS:
| -268.670049720572 | -197.446410393814 | 1 |
| -204.716996054851 | -197.446410393814 | 1 |
|  -140.76394238913 | -197.446410393814 | 1 |
| -76.8108887234097 | -197.446410393814 | 1 |
|  -12.857835057689 | -197.446410393814 | 1 |
|  51.0952186080318 | -197.446410393814 | 1 |
|  115.048272273752 | -197.446410393814 | 1 |
|  179.001325939473 | -197.446410393814 | 1 |
|  242.954379605194 | -197.446410393814 | 1 |
|  306.907433270915 | -197.446410393814 | 1 |
| -268.670049720572 | -152.293506297179 | 1 |
| -204.716996054851 | -152.293506297179 | 1 |
|  -140.76394238913 | -152.293506297179 | 1 |
| -76.8108887234097 | -152.293506297179 | 1 |
|  -12.857835057689 | -152.293506297179 | 1 |
|  51.0952186080318 | -152.293506297179 | 1 |
|  115.048272273752 | -152.293506297179 | 1 |
|  179.001325939473 | -152.293506297179 | 1 |
|  242.954379605194 | -152.293506297179 | 1 |
|  306.907433270915 | -152.293506297179 | 1 |
| -268.670049720572 | -107.140602200543 | 1 |
| -204.716996054851 | -107.140602200543 | 1 |
|  -140.76394238913 | -107.140602200543 | 1 |
| -76.8108887234097 | -107.140602200543 | 1 |
|  -12.857835057689 | -107.140602200543 | 1 |
|  51.0952186080318 | -107.140602200543 | 1 |
|  115.048272273752 | -107.140602200543 | 1 |
|  179.001325939473 | -107.140602200543 | 1 |
|  242.954379605194 | -107.140602200543 | 1 |
|  306.907433270915 | -107.140602200543 | 1 |
| -268.670049720572 | -61.9876981039078 | 1 |
| -204.716996054851 | -61.9876981039078 | 1 |
|  -140.76394238913 | -61.9876981039078 | 1 |
| -76.8108887234097 | -61.9876981039078 | 1 |
|  -12.857835057689 | -61.9876981039078 | 1 |
|  51.0952186080318 | -61.9876981039078 | 1 |
|  115.048272273752 | -61.9876981039078 | 1 |
|  179.001325939473 | -61.9876981039078 | 1 |
|  242.954379605194 | -61.9876981039078 | 1 |
|  306.907433270915 | -61.9876981039078 | 1 |
| -268.670049720572 | -16.8347940072724 | 1 |
| -204.716996054851 | -16.8347940072724 | 1 |
|  -140.76394238913 | -16.8347940072724 | 1 |
| -76.8108887234097 | -16.8347940072724 | 1 |
|  -12.857835057689 | -16.8347940072724 | 1 |
|  51.0952186080318 | -16.8347940072724 | 1 |
|  115.048272273752 | -16.8347940072724 | 1 |
|  179.001325939473 | -16.8347940072724 | 1 |
|  242.954379605194 | -16.8347940072724 | 1 |
|  306.907433270915 | -16.8347940072724 | 1 |
| -268.670049720572 |   28.318110089363 | 1 |
| -204.716996054851 |   28.318110089363 | 1 |
|  -140.76394238913 |   28.318110089363 | 1 |
| -76.8108887234097 |   28.318110089363 | 1 |
|  -12.857835057689 |   28.318110089363 | 1 |
|  51.0952186080318 |   28.318110089363 | 1 |
|  115.048272273752 |   28.318110089363 | 1 |
|  179.001325939473 |   28.318110089363 | 1 |
|  242.954379605194 |   28.318110089363 | 1 |
|  306.907433270915 |   28.318110089363 | 1 |
| -268.670049720572 |  73.4710141859984 | 1 |
| -204.716996054851 |  73.4710141859984 | 1 |
|  -140.76394238913 |  73.4710141859984 | 1 |
| -76.8108887234097 |  73.4710141859984 | 1 |
|  -12.857835057689 |  73.4710141859984 | 1 |
|  51.0952186080318 |  73.4710141859984 | 1 |
|  115.048272273752 |  73.4710141859984 | 1 |
|  179.001325939473 |  73.4710141859984 | 1 |
|  242.954379605194 |  73.4710141859984 | 1 |
|  306.907433270915 |  73.4710141859984 | 1 |
| -268.670049720572 |  118.623918282634 | 1 |
| -204.716996054851 |  118.623918282634 | 1 |
|  -140.76394238913 |  118.623918282634 | 1 |
| -76.8108887234097 |  118.623918282634 | 1 |
|  -12.857835057689 |  118.623918282634 | 1 |
|  51.0952186080318 |  118.623918282634 | 1 |
|  115.048272273752 |  118.623918282634 | 1 |
|  179.001325939473 |  118.623918282634 | 1 |
|  242.954379605194 |  118.623918282634 | 1 |
|  306.907433270915 |  118.623918282634 | 1 |
| -268.670049720572 |  163.776822379269 | 1 |
| -204.716996054851 |  163.776822379269 | 1 |
|  -140.76394238913 |  163.776822379269 | 1 |
| -76.8108887234097 |  163.776822379269 | 1 |
|  -12.857835057689 |  163.776822379269 | 1 |
|  51.0952186080318 |  163.776822379269 | 1 |
|  115.048272273752 |  163.776822379269 | 1 |
|  179.001325939473 |  163.776822379269 | 1 |
|  242.954379605194 |  163.776822379269 | 1 |
|  306.907433270915 |  163.776822379269 | 1 |
| -268.670049720572 |  208.929726475905 | 1 |
| -204.716996054851 |  208.929726475905 | 1 |
|  -140.76394238913 |  208.929726475905 | 1 |
| -76.8108887234097 |  208.929726475905 | 1 |
|  -12.857835057689 |  208.929726475905 | 1 |
|  51.0952186080318 |  208.929726475905 | 1 |
|  115.048272273752 |  208.929726475905 | 1 |
|  179.001325939473 |  208.929726475905 | 1 |
|  242.954379605194 |  208.929726475905 | 1 |
|  306.907433270915 |  208.929726475905 | 1 |
| -268.670049720572 | -197.446410393814 | 2 |
| -204.716996054851 | -197.446410393814 | 2 |
|  -140.76394238913 | -197.446410393814 | 2 |
| -76.8108887234097 | -197.446410393814 | 2 |
|  -12.857835057689 | -197.446410393814 | 2 |
|  51.0952186080318 | -197.446410393814 | 2 |
|  115.048272273752 | -197.446410393814 | 2 |
|  179.001325939473 | -197.446410393814 | 2 |
|  242.954379605194 | -197.446410393814 | 2 |
|  306.907433270915 | -197.446410393814 | 2 |
| -268.670049720572 | -152.293506297179 | 2 |
| -204.716996054851 | -152.293506297179 | 2 |
|  -140.76394238913 | -152.293506297179 | 2 |
| -76.8108887234097 | -152.293506297179 | 2 |
|  -12.857835057689 | -152.293506297179 | 2 |
|  51.0952186080318 | -152.293506297179 | 2 |
|  115.048272273752 | -152.293506297179 | 2 |
|  179.001325939473 | -152.293506297179 | 2 |
|  242.954379605194 | -152.293506297179 | 2 |
|  306.907433270915 | -152.293506297179 | 2 |
| -268.670049720572 | -107.140602200543 | 2 |
| -204.716996054851 | -107.140602200543 | 2 |
|  -140.76394238913 | -107.140602200543 | 2 |
| -76.8108887234097 | -107.140602200543 | 2 |
|  -12.857835057689 | -107.140602200543 | 2 |
|  51.0952186080318 | -107.140602200543 | 2 |
|  115.048272273752 | -107.140602200543 | 2 |
|  179.001325939473 | -107.140602200543 | 2 |
|  242.954379605194 | -107.140602200543 | 2 |
|  306.907433270915 | -107.140602200543 | 2 |
| -268.670049720572 | -61.9876981039078 | 2 |
| -204.716996054851 | -61.9876981039078 | 2 |
|  -140.76394238913 | -61.9876981039078 | 2 |
| -76.8108887234097 | -61.9876981039078 | 2 |
|  -12.857835057689 | -61.9876981039078 | 2 |
|  51.0952186080318 | -61.9876981039078 | 2 |
|  115.048272273752 | -61.9876981039078 | 2 |
|  179.001325939473 | -61.9876981039078 | 2 |
|  242.954379605194 | -61.9876981039078 | 2 |
|  306.907433270915 | -61.9876981039078 | 2 |
| -268.670049720572 | -16.8347940072724 | 2 |
| -204.716996054851 | -16.8347940072724 | 2 |
|  -140.76394238913 | -16.8347940072724 | 2 |
| -76.8108887234097 | -16.8347940072724 | 2 |
|  -12.857835057689 | -16.8347940072724 | 2 |
|  51.0952186080318 | -16.8347940072724 | 2 |
|  115.048272273752 | -16.8347940072724 | 2 |
|  179.001325939473 | -16.8347940072724 | 2 |
|  242.954379605194 | -16.8347940072724 | 2 |
|  306.907433270915 | -16.8347940072724 | 2 |
| -268.670049720572 |   28.318110089363 | 2 |
| -204.716996054851 |   28.318110089363 | 2 |
|  -140.76394238913 |   28.318110089363 | 2 |
| -76.8108887234097 |   28.318110089363 | 2 |
|  -12.857835057689 |   28.318110089363 | 2 |
|  51.0952186080318 |   28.318110089363 | 2 |
|  115.048272273752 |   28.318110089363 | 2 |
|  179.001325939473 |   28.318110089363 | 2 |
|  242.954379605194 |   28.318110089363 | 2 |
|  306.907433270915 |   28.318110089363 | 2 |
| -268.670049720572 |  73.4710141859984 | 2 |
| -204.716996054851 |  73.4710141859984 | 2 |
|  -140.76394238913 |  73.4710141859984 | 2 |
| -76.8108887234097 |  73.4710141859984 | 2 |
|  -12.857835057689 |  73.4710141859984 | 2 |
|  51.0952186080318 |  73.4710141859984 | 2 |
|  115.048272273752 |  73.4710141859984 | 2 |
|  179.001325939473 |  73.4710141859984 | 2 |
|  242.954379605194 |  73.4710141859984 | 2 |
|  306.907433270915 |  73.4710141859984 | 2 |
| -268.670049720572 |  118.623918282634 | 2 |
| -204.716996054851 |  118.623918282634 | 2 |
|  -140.76394238913 |  118.623918282634 | 2 |
| -76.8108887234097 |  118.623918282634 | 2 |
|  -12.857835057689 |  118.623918282634 | 2 |
|  51.0952186080318 |  118.623918282634 | 2 |
|  115.048272273752 |  118.623918282634 | 2 |
|  179.001325939473 |  118.623918282634 | 2 |
|  242.954379605194 |  118.623918282634 | 2 |
|  306.907433270915 |  118.623918282634 | 2 |
| -268.670049720572 |  163.776822379269 | 2 |
| -204.716996054851 |  163.776822379269 | 2 |
|  -140.76394238913 |  163.776822379269 | 2 |
| -76.8108887234097 |  163.776822379269 | 2 |
|  -12.857835057689 |  163.776822379269 | 2 |
|  51.0952186080318 |  163.776822379269 | 2 |
|  115.048272273752 |  163.776822379269 | 2 |
|  179.001325939473 |  163.776822379269 | 2 |
|  242.954379605194 |  163.776822379269 | 2 |
|  306.907433270915 |  163.776822379269 | 2 |
| -268.670049720572 |  208.929726475905 | 2 |
| -204.716996054851 |  208.929726475905 | 2 |
|  -140.76394238913 |  208.929726475905 | 2 |
| -76.8108887234097 |  208.929726475905 | 2 |
|  -12.857835057689 |  208.929726475905 | 2 |
|  51.0952186080318 |  208.929726475905 | 2 |
|  115.048272273752 |  208.929726475905 | 2 |
|  179.001325939473 |  208.929726475905 | 2 |
|  242.954379605194 |  208.929726475905 | 2 |
|  306.907433270915 |  208.929726475905 | 2 |
| -268.670049720572 | -197.446410393814 | 3 |
| -204.716996054851 | -197.446410393814 | 3 |
|  -140.76394238913 | -197.446410393814 | 3 |
| -76.8108887234097 | -197.446410393814 | 3 |
|  -12.857835057689 | -197.446410393814 | 3 |
|  51.0952186080318 | -197.446410393814 | 3 |
|  115.048272273752 | -197.446410393814 | 3 |
|  179.001325939473 | -197.446410393814 | 3 |
|  242.954379605194 | -197.446410393814 | 3 |
|  306.907433270915 | -197.446410393814 | 3 |
| -268.670049720572 | -152.293506297179 | 3 |
| -204.716996054851 | -152.293506297179 | 3 |
|  -140.76394238913 | -152.293506297179 | 3 |
| -76.8108887234097 | -152.293506297179 | 3 |
|  -12.857835057689 | -152.293506297179 | 3 |
|  51.0952186080318 | -152.293506297179 | 3 |
|  115.048272273752 | -152.293506297179 | 3 |
|  179.001325939473 | -152.293506297179 | 3 |
|  242.954379605194 | -152.293506297179 | 3 |
|  306.907433270915 | -152.293506297179 | 3 |
| -268.670049720572 | -107.140602200543 | 3 |
| -204.716996054851 | -107.140602200543 | 3 |
|  -140.76394238913 | -107.140602200543 | 3 |
| -76.8108887234097 | -107.140602200543 | 3 |
|  -12.857835057689 | -107.140602200543 | 3 |
|  51.0952186080318 | -107.140602200543 | 3 |
|  115.048272273752 | -107.140602200543 | 3 |
|  179.001325939473 | -107.140602200543 | 3 |
|  242.954379605194 | -107.140602200543 | 3 |
|  306.907433270915 | -107.140602200543 | 3 |
| -268.670049720572 | -61.9876981039078 | 3 |
| -204.716996054851 | -61.9876981039078 | 3 |
|  -140.76394238913 | -61.9876981039078 | 3 |
| -76.8108887234097 | -61.9876981039078 | 3 |
|  -12.857835057689 | -61.9876981039078 | 3 |
|  51.0952186080318 | -61.9876981039078 | 3 |
|  115.048272273752 | -61.9876981039078 | 3 |
|  179.001325939473 | -61.9876981039078 | 3 |
|  242.954379605194 | -61.9876981039078 | 3 |
|  306.907433270915 | -61.9876981039078 | 3 |
| -268.670049720572 | -16.8347940072724 | 3 |
| -204.716996054851 | -16.8347940072724 | 3 |
|  -140.76394238913 | -16.8347940072724 | 3 |
| -76.8108887234097 | -16.8347940072724 | 3 |
|  -12.857835057689 | -16.8347940072724 | 3 |
|  51.0952186080318 | -16.8347940072724 | 3 |
|  115.048272273752 | -16.8347940072724 | 3 |
|  179.001325939473 | -16.8347940072724 | 3 |
|  242.954379605194 | -16.8347940072724 | 3 |
|  306.907433270915 | -16.8347940072724 | 3 |
| -268.670049720572 |   28.318110089363 | 3 |
| -204.716996054851 |   28.318110089363 | 3 |
|  -140.76394238913 |   28.318110089363 | 3 |
| -76.8108887234097 |   28.318110089363 | 3 |
|  -12.857835057689 |   28.318110089363 | 3 |
|  51.0952186080318 |   28.318110089363 | 3 |
|  115.048272273752 |   28.318110089363 | 3 |
|  179.001325939473 |   28.318110089363 | 3 |
|  242.954379605194 |   28.318110089363 | 3 |
|  306.907433270915 |   28.318110089363 | 3 |
| -268.670049720572 |  73.4710141859984 | 3 |
| -204.716996054851 |  73.4710141859984 | 3 |
|  -140.76394238913 |  73.4710141859984 | 3 |
| -76.8108887234097 |  73.4710141859984 | 3 |
|  -12.857835057689 |  73.4710141859984 | 3 |
|  51.0952186080318 |  73.4710141859984 | 3 |
|  115.048272273752 |  73.4710141859984 | 3 |
|  179.001325939473 |  73.4710141859984 | 3 |
|  242.954379605194 |  73.4710141859984 | 3 |
|  306.907433270915 |  73.4710141859984 | 3 |
| -268.670049720572 |  118.623918282634 | 3 |
| -204.716996054851 |  118.623918282634 | 3 |
|  -140.76394238913 |  118.623918282634 | 3 |
| -76.8108887234097 |  118.623918282634 | 3 |
|  -12.857835057689 |  118.623918282634 | 3 |
|  51.0952186080318 |  118.623918282634 | 3 |
|  115.048272273752 |  118.623918282634 | 3 |
|  179.001325939473 |  118.623918282634 | 3 |
|  242.954379605194 |  118.623918282634 | 3 |
|  306.907433270915 |  118.623918282634 | 3 |
| -268.670049720572 |  163.776822379269 | 3 |
| -204.716996054851 |  163.776822379269 | 3 |
|  -140.76394238913 |  163.776822379269 | 3 |
| -76.8108887234097 |  163.776822379269 | 3 |
|  -12.857835057689 |  163.776822379269 | 3 |
|  51.0952186080318 |  163.776822379269 | 3 |
|  115.048272273752 |  163.776822379269 | 3 |
|  179.001325939473 |  163.776822379269 | 3 |
|  242.954379605194 |  163.776822379269 | 3 |
|  306.907433270915 |  163.776822379269 | 3 |
| -268.670049720572 |  208.929726475905 | 3 |
| -204.716996054851 |  208.929726475905 | 3 |
|  -140.76394238913 |  208.929726475905 | 3 |
| -76.8108887234097 |  208.929726475905 | 3 |
|  -12.857835057689 |  208.929726475905 | 3 |
|  51.0952186080318 |  208.929726475905 | 3 |
|  115.048272273752 |  208.929726475905 | 3 |
|  179.001325939473 |  208.929726475905 | 3 |
|  242.954379605194 |  208.929726475905 | 3 |
|  306.907433270915 |  208.929726475905 | 3 |
| -268.670049720572 | -197.446410393814 | 4 |
| -204.716996054851 | -197.446410393814 | 4 |
|  -140.76394238913 | -197.446410393814 | 4 |
| -76.8108887234097 | -197.446410393814 | 4 |
|  -12.857835057689 | -197.446410393814 | 4 |
|  51.0952186080318 | -197.446410393814 | 4 |
|  115.048272273752 | -197.446410393814 | 4 |
|  179.001325939473 | -197.446410393814 | 4 |
|  242.954379605194 | -197.446410393814 | 4 |
|  306.907433270915 | -197.446410393814 | 4 |
| -268.670049720572 | -152.293506297179 | 4 |
| -204.716996054851 | -152.293506297179 | 4 |
|  -140.76394238913 | -152.293506297179 | 4 |
| -76.8108887234097 | -152.293506297179 | 4 |
|  -12.857835057689 | -152.293506297179 | 4 |
|  51.0952186080318 | -152.293506297179 | 4 |
|  115.048272273752 | -152.293506297179 | 4 |
|  179.001325939473 | -152.293506297179 | 4 |
|  242.954379605194 | -152.293506297179 | 4 |
|  306.907433270915 | -152.293506297179 | 4 |
| -268.670049720572 | -107.140602200543 | 4 |
| -204.716996054851 | -107.140602200543 | 4 |
|  -140.76394238913 | -107.140602200543 | 4 |
| -76.8108887234097 | -107.140602200543 | 4 |
|  -12.857835057689 | -107.140602200543 | 4 |
|  51.0952186080318 | -107.140602200543 | 4 |
|  115.048272273752 | -107.140602200543 | 4 |
|  179.001325939473 | -107.140602200543 | 4 |
|  242.954379605194 | -107.140602200543 | 4 |
|  306.907433270915 | -107.140602200543 | 4 |
| -268.670049720572 | -61.9876981039078 | 4 |
| -204.716996054851 | -61.9876981039078 | 4 |
|  -140.76394238913 | -61.9876981039078 | 4 |
| -76.8108887234097 | -61.9876981039078 | 4 |
|  -12.857835057689 | -61.9876981039078 | 4 |
|  51.0952186080318 | -61.9876981039078 | 4 |
|  115.048272273752 | -61.9876981039078 | 4 |
|  179.001325939473 | -61.9876981039078 | 4 |
|  242.954379605194 | -61.9876981039078 | 4 |
|  306.907433270915 | -61.9876981039078 | 4 |
| -268.670049720572 | -16.8347940072724 | 4 |
| -204.716996054851 | -16.8347940072724 | 4 |
|  -140.76394238913 | -16.8347940072724 | 4 |
| -76.8108887234097 | -16.8347940072724 | 4 |
|  -12.857835057689 | -16.8347940072724 | 4 |
|  51.0952186080318 | -16.8347940072724 | 4 |
|  115.048272273752 | -16.8347940072724 | 4 |
|  179.001325939473 | -16.8347940072724 | 4 |
|  242.954379605194 | -16.8347940072724 | 4 |
|  306.907433270915 | -16.8347940072724 | 4 |
| -268.670049720572 |   28.318110089363 | 4 |
| -204.716996054851 |   28.318110089363 | 4 |
|  -140.76394238913 |   28.318110089363 | 4 |
| -76.8108887234097 |   28.318110089363 | 4 |
|  -12.857835057689 |   28.318110089363 | 4 |
|  51.0952186080318 |   28.318110089363 | 4 |
|  115.048272273752 |   28.318110089363 | 4 |
|  179.001325939473 |   28.318110089363 | 4 |
|  242.954379605194 |   28.318110089363 | 4 |
|  306.907433270915 |   28.318110089363 | 4 |
| -268.670049720572 |  73.4710141859984 | 4 |
| -204.716996054851 |  73.4710141859984 | 4 |
|  -140.76394238913 |  73.4710141859984 | 4 |
| -76.8108887234097 |  73.4710141859984 | 4 |
|  -12.857835057689 |  73.4710141859984 | 4 |
|  51.0952186080318 |  73.4710141859984 | 4 |
|  115.048272273752 |  73.4710141859984 | 4 |
|  179.001325939473 |  73.4710141859984 | 4 |
|  242.954379605194 |  73.4710141859984 | 4 |
|  306.907433270915 |  73.4710141859984 | 4 |
| -268.670049720572 |  118.623918282634 | 4 |
| -204.716996054851 |  118.623918282634 | 4 |
|  -140.76394238913 |  118.623918282634 | 4 |
| -76.8108887234097 |  118.623918282634 | 4 |
|  -12.857835057689 |  118.623918282634 | 4 |
|  51.0952186080318 |  118.623918282634 | 4 |
|  115.048272273752 |  118.623918282634 | 4 |
|  179.001325939473 |  118.623918282634 | 4 |
|  242.954379605194 |  118.623918282634 | 4 |
|  306.907433270915 |  118.623918282634 | 4 |
| -268.670049720572 |  163.776822379269 | 4 |
| -204.716996054851 |  163.776822379269 | 4 |
|  -140.76394238913 |  163.776822379269 | 4 |
| -76.8108887234097 |  163.776822379269 | 4 |
|  -12.857835057689 |  163.776822379269 | 4 |
|  51.0952186080318 |  163.776822379269 | 4 |
|  115.048272273752 |  163.776822379269 | 4 |
|  179.001325939473 |  163.776822379269 | 4 |
|  242.954379605194 |  163.776822379269 | 4 |
|  306.907433270915 |  163.776822379269 | 4 |
| -268.670049720572 |  208.929726475905 | 4 |
| -204.716996054851 |  208.929726475905 | 4 |
|  -140.76394238913 |  208.929726475905 | 4 |
| -76.8108887234097 |  208.929726475905 | 4 |
|  -12.857835057689 |  208.929726475905 | 4 |
|  51.0952186080318 |  208.929726475905 | 4 |
|  115.048272273752 |  208.929726475905 | 4 |
|  179.001325939473 |  208.929726475905 | 4 |
|  242.954379605194 |  208.929726475905 | 4 |
|  306.907433270915 |  208.929726475905 | 4 |

#+BEGIN_SRC R
pollock_data <- prepare_data(pollock_df, index_df, mesh, fem)
pollock_pars <- prepare_pars(pollock_data, mesh)
pollock_estd <- specify_estimated(omega = FALSE, lambda = FALSE)
pollock_map <- prepare_map(pollock_pars, pollock_estd)
pollock_random <- prepare_random(pollock_map)
pollock_data$proc_switch <- prepare_proc_switch(pollock_random)
## pollock_obj <- prepare_adfun(pollock_data,
##                              pollock_pars,
##                              pollock_map,
##                              pollock_random,
##                              runSymbolicanalysis = FALSE,
##                              normalize = TRUE)
pollock_obj <- MakeADFun(data = pollock_data,
                         parameters = pollock_pars,
                         map = pollock_map,
                         random = NULL,
                         DLL = "spatq")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R
pollock_fit <- optim(pollock_obj$par, pollock_obj$fn, pollock_obj$gr,
                     method = "BFGS")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R
pollock2_data <- prepare_data(pollock_df, index_df, mesh, fem)

pollock2_pars <- prepare_pars(pollock2_data, mesh)
pollock2_pars$beta_n <- pollock_fit$par[names(pollock_fit$par) == "beta_n"]
pollock2_pars$beta_w <- pollock_fit$par[names(pollock_fit$par) == "beta_w"]
pollock2_pars$log_sigma <- pollock_fit$par[names(pollock_fit$par) == "log_sigma"]
pollock2_pars$log_kappa <- rep_along(pollock2_pars$log_kappa, log(pars_kappa(400)))
pollock2_pars$log_tau <- rep_along(pollock2_pars$log_tau, log(pars_tau(1, 400)))

pollock2_estd <- specify_estimated(omega = TRUE, lambda = FALSE)
pollock2_map <- prepare_map(pollock2_pars, pollock2_estd)
pollock2_random <- prepare_random(pollock2_map)
pollock2_data$proc_switch <- prepare_proc_switch(pollock2_random)

pollock2_obj <- prepare_adfun(pollock2_data,
                              pollock2_pars,
                              pollock2_map,
                              pollock2_random,
                              runSymbolicanalysis = TRUE,
                              normalize = FALSE)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R
pollock2_fit <- optim(pollock2_obj$par,
                      pollock2_obj$fn,
                      pollock2_obj$gr,
                      method = "BFGS")

#+END_SRC

#+RESULTS:
: TRUE


#+BEGIN_SRC R
testpars <- pollock2_obj$par
testparsk
pollock2_obj$fn(testpars)
#+END_SRC
